laravel/app/Http/Controllers/FileController.php

    public function index()
    {
        return view("files.index", [
            "files" => File::all()
        ]);
---
select * from `files`

    public function store(Request $request)
    {
        //
        // Validar fitxer
        $validatedData = $request->validate([
            'upload' => 'required|mimes:gif,jpeg,jpg,png|max:1024'
        ]);

        // Obtenir dades del fitxer
        $upload = $request->file('upload');
        $fileName = $upload->getClientOriginalName();
        $fileSize = $upload->getSize();
        \Log::debug("Storing file '{$fileName}' ($fileSize)...");

        // Pujar fitxer al disc dur
        $uploadName = time() . '_' . $fileName;
        $filePath = $upload->storeAs(
            'uploads',      // Path
            $uploadName ,   // Filename
            'public'        // Disk
        );

        if (\Storage::disk('public')->exists($filePath)) {
            \Log::debug("Local storage OK");
            $fullPath = \Storage::disk('public')->path($filePath);
            \Log::debug("File saved at {$fullPath}");
            // Desar dades a BD
            $file = File::create([
                'filepath' => $filePath,
                'filesize' => $fileSize,
            ]);
---
insert into `files` (`filepath`, `filesize`, `updated_at`, `created_at`) values ('uploads/1666705041_w3c.jpg', 127535, '2022-10-25 13:37:22', '2022-10-25 13:37:22')