laravel/app/Http/Controllers/Auth/RegisteredUserController.php

insert into `users` (`name`, `email`, `password`, `role_id`, `updated_at`, `created_at`) values ('ikerc', 'ikcaca@fp.insjoaquimmir.cat', '$2y$10$ZJygZVX11XZUuFuBMmkQ6eVBhaw307bO7wEuNMXKYb317aTWx7ecG', 1, '2022-10-20 14:31:02', '2022-10-20 14:31:02')
---
    public function store(Request $request)
    {
        $request->validate([
            'name' => ['required', 'string', 'max:255'],
            'email' => ['required', 'string', 'email', 'max:255', 'unique:users'],
            'password' => ['required', 'confirmed', Rules\Password::defaults()],
        ]);

        $user = User::create([
            'name' => $request->name,
            'email' => $request->email,
            'password' => Hash::make($request->password),
            'role_id' => 1,
        ]);