laravel/app/Http/Controllers/Auth/RegisterController.php

insert into `users` (`name`, `email`, `password`, `role_id`, `updated_at`, `created_at`) values ('ikerc', 'ikcaca@fp.insjoaquimmir.cat', '$2y$10$d.vQu2t2R228QAun3n3J1epPuwLEio.dh2.1PX0jBAmcWe8QfWjwi', 1, '2022-10-24 15:10:18', '2022-10-24 15:10:18')
---
    protected function create(array $data)
    {
        $user = User::create([
            'name' => $data['name'],
            'email' => $data['email'],
            'password' => Hash::make($data['password']),
        ]);